//^^1. Написать функцию, получающую на вход два числа. Если оба числа
//^^ `чётные - функция возвращает их произведение. Если оба числа нечётные``- функция возвращает их сумму. Если одно из чисел чётное, а второе``нечётное - функция возвращает это нечётное число.`
//
function numbers(num1, num2) {
  if (num1 % 2 === 0 && num2 % 2 === 0) {
    return num1 * num2;
  } else if (num1 % 2 !== 0 && num2 % 2 !== 0) {
    return num2 + num1;
  } else {
    return num1 % 2 === 0 ? num2 : num1;
  }
}
console.log(numbers(2, 8));
console.log(numbers(3, 11));
console.log(numbers(2, 7));
